ELPasEDT/src/DataProcessors/ЗагрузкаВидовЗаписейИСобытий_xls/ЗагрузкаВидовЗаписейИСобытий_xls.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаВидовЗаписейИСобытий_xls</name>
  <attributes>
    <name>Файл</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фильтр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

ELPasEDT/src/DataProcessors/ЗагрузкаВидовЗаписейИСобытий_xls/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;	
	
	Диалог = Новый ДиалогВыбораФайла(Режим); 
	Диалог.Фильтр = "Файлы Excel (*.xlsx)|*" + СокрЛП(Объект.Фильтр) + "*.xlsx";
	Если Диалог.Выбрать() Тогда	
		ИмяФайла = Диалог.ВыбранныеФайлы[0];
		Объект.Файл = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзXLS(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ПоказатьПредупреждение(, "Заполнение организации обязательно!");
		Возврат;
	КонецЕсли;
	
	ТаблицаЗначений.Очистить();
	
	ОбщКол = 0;
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Workbook = Excel.Workbooks.Open(Объект.Файл);
		Лист = Excel.Sheets(1);
	Исключение
		Workbook = Неопределено;
		Excel = Неопределено;
		Возврат;
	КонецПопытки;
	
	// загрузить данные в ТЗ
	ЧислоСтрокВФайле = Лист.Cells(1,1).SpecialCells(11).Row;
	инд = 2;
	Пока инд > 0 Цикл
		
		К1 = Лист.Cells(инд, 1).Text;
		К2 = Лист.Cells(инд, 2).Text;
		К3 = Лист.Cells(инд, 3).Text;
		
		Если ЗначениеЗаполнено(К3) Тогда
			Новссс = ТаблицаЗначений.Добавить();
			Новссс.К1 = К1;
			Новссс.К2 = К2;
			Новссс.К3 = К3;
		КонецЕсли;		  		
		
		инд = инд + 1;
		Если инд > ЧислоСтрокВФайле Тогда
			Прервать;
		КонецЕсли; 
	КонецЦикла;
	
	Excel.Quit();
	Workbook = Неопределено;
	Excel = Неопределено;
	
	ЗагрузитьВБД();
	ПоказатьПредупреждение(, "Загрузка завершена!");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВБД()
	
	//Загрузка в БД
	Для Каждого ТекСтр Из ТаблицаЗначений Цикл
		
		//Вид записи
		ТекВидЗаписи = СокрЛП(ТекСтр.К2);
		Если ЗначениеЗаполнено(ТекВидЗаписи) Тогда
			ВидЗаписи = НайтиВидЗаписи(ТекВидЗаписи);
			Если ВидЗаписи = Неопределено Тогда
				ВидЗаписиОбъект = Справочники.ВидыЗаписей.СоздатьЭлемент();
				ВидЗаписиОбъект.Наименование = ТекВидЗаписи;
				ВидЗаписиОбъект.Организация = Объект.Организация;
				Попытка
					ВидЗаписиОбъект.Записать();
				Исключение
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Не удалось записать вид записи: " + ТекВидЗаписи;
					Сообщение.Сообщить();
					Возврат;
				КонецПопытки;
			Иначе
				ВидЗаписиОбъект = ВидЗаписи.ПолучитьОбъект(); 
			КонецЕсли;
		КонецЕсли;
		
		//Событие
		ТекСобытие = СокрЛП(ТекСтр.К3);
		Событие = НайтиСобытие(ТекСобытие);
		Если Событие = Неопределено Тогда
			НовСобытие = Справочники.События.СоздатьЭлемент();
			НовСобытие.Наименование = ТекСобытие;
			НовСобытие.Организация = Объект.Организация;
			Попытка
				НовСобытие.Записать();
			Исключение
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Не удалось записать событие: " + ТекСобытие;
				Сообщение.Сообщить();
				Возврат;
			КонецПопытки;
			Событие = НовСобытие.Ссылка;
		КонецЕсли;
		
		//Ищем данное событие в виде записи
		Если Не НайтиСобытиеВВидеЗаписи(Событие) Тогда 			
			НовСтрока = ВидЗаписиОбъект.События.Добавить();
			НовСтрока.Событие = Событие;
			Если Не ЗначениеЗаполнено(ВидЗаписиОбъект.СобытиеПоУмолчанию) Тогда
				ВидЗаписиОбъект.СобытиеПоУмолчанию = Событие;
			КонецЕсли;
			Попытка
				ВидЗаписиОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НайтиВидЗаписи(Наименование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыЗаписей.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыЗаписей КАК ВидыЗаписей
		|ГДЕ
		|	НЕ ВидыЗаписей.ПометкаУдаления
		|	И ВидыЗаписей.Наименование = &Наименование
		|	И ВидыЗаписей.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Наименование", СокрЛП(Наименование));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция НайтиСобытие(Наименование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	События.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.События КАК События
		|ГДЕ
		|	НЕ События.ПометкаУдаления
		|	И События.Наименование = &Наименование
		|	И События.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Наименование", СокрЛП(Наименование));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция НайтиСобытиеВВидеЗаписи(Событие)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыЗаписейСобытия.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыЗаписей.События КАК ВидыЗаписейСобытия
		|ГДЕ
		|	НЕ ВидыЗаписейСобытия.Ссылка.ПометкаУдаления
		|	И ВидыЗаписейСобытия.Событие = &Событие";
	
	Запрос.УстановитьПараметр("Событие", Событие);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
